{
	"1": [
		[
			{
				"slopes": [
					[
						20.0,
						845.451
					],
					[
						0.0,
						1205.1674
					],
					[
						5.0,
						1363.6692,
						0.0
					],
					[
						0.0,
						1463.4951
					],
					[
						45.0,
						2346.2218
					],
					[
						0.0,
						2596.9441
					],
					[
						25.0,
						3295.4179
					],
					[
						15.0,
						3517.8838
					],
					[
						20.0,
						3598.3329
					],
					[
						0.0,
						3808.7421
					],
					[
						10.0,
						3958.802,
						2.0
					],
					[
						0.0,
						3999.1842
					],
					[
						20.0,
						4478.8099
					],
					[
						15.0,
						4548.849
					],
					[
						45.0,
						4598.6701
					],
					[
						25.0,
						4798.757
					],
					[
						0.0,
						4898.2389
					],
					[
						-20.0,
						5636.8246
					],
					[
						0.0,
						6053.7193
					],
					[
						-5.0,
						6293.4981,
						0.0
					],
					[
						0.0,
						6644.8761
					],
					[
						35.0,
						6849.7321
					],
					[
						0.0,
						7069.9078
					],
					[
						45.0,
						7649.3506
					],
					[
						0.0,
						7938.5793
					],
					[
						45.0,
						8188.3756
					],
					[
						0.0,
						8518.7076
					],
					[
						10.0,
						8637.2944
					],
					[
						0.0,
						8846.9184
					],
					[
						35.0,
						9346.8366
					],
					[
						40.0,
						9427.1725
					],
					[
						35.0,
						9477.2283
					],
					[
						0.0,
						9656.104
					],
					[
						20.0,
						9666.0144
					],
					[
						0.0,
						9814.4795
					],
					[
						10.0,
						9909.9192,
						1.0
					],
					[
						0.0,
						10118.4314
					],
					[
						10.0,
						10877.6026,
						6.0
					],
					[
						0.0,
						10957.3241
					]
				],
				"slopeLength": 79.7215,
				"sensors": [
					199.9342,
					295.2651,
					1222.2821,
					1324.6847,
					2841.8153,
					2939.5584,
					4010.8822,
					4113.9494,
					5499.0453,
					5597.7516,
					7259.7772,
					7355.9965,
					8866.3448,
					10974.6384,
					11078.0379
				],
				"stations": [
					{
						"path": 1.0,
						"pos": 311.7655,
						"linkedSensor": 1.0,
						"id": 110.0,
						"isHorlift": false,
						"rightDoors": false,
						"name": "Международная",
						"isLast": false
					},
					{
						"path": 1.0,
						"pos": 1340.3142,
						"linkedSensor": 3.0,
						"id": 111.0,
						"isHorlift": false,
						"rightDoors": false,
						"name": "Парк культуры",
						"isLast": false
					},
					{
						"linkedSensor": 5.0,
						"id": 112.0,
						"path": 1.0,
						"pos": 2955.1122,
						"hasSwitches": true,
						"isHorlift": false,
						"rightDoors": false,
						"name": "Политехническая",
						"isLast": false
					},
					{
						"path": 1.0,
						"pos": 4129.6481,
						"linkedSensor": 7.0,
						"id": 113.0,
						"isHorlift": false,
						"rightDoors": false,
						"name": "Проспект суворова",
						"isLast": false
					},
					{
						"linkedSensor": 9.0,
						"id": 114.0,
						"path": 1.0,
						"pos": 5613.2086,
						"hasSwitches": true,
						"isHorlift": false,
						"rightDoors": false,
						"name": "Нахимовская",
						"isLast": false
					},
					{
						"dist_last_start": 7497.1201,
						"dist_last_end": 7672.1201,
						"linkedSensor": 11.0,
						"id": 115.0,
						"path": 1.0,
						"isInWrong": true,
						"name_last": "Октябрьской",
						"pos": 7372.6212,
						"isHorlift": false,
						"rightDoors": false,
						"name": "Октябрьская",
						"isLast": true
					},
					{
						"dist_last_start": 9048.6695,
						"dist_last_end": 10002.6695,
						"linkedSensor": 13.0,
						"id": 116.0,
						"path": 1.0,
						"pos": 8977.8898,
						"hasSwitches": true,
						"name_last": "Речной",
						"isHorlift": false,
						"rightDoors": true,
						"name": "Речная",
						"isLast": true
					},
					{
						"dist_last_start": 11293.0817,
						"dist_last_end": 11543.0817,
						"linkedSensor": 14.0,
						"id": 117.0,
						"path": 1.0,
						"isInWrong": false,
						"name_last": "Пролетарской",
						"pos": 11093.6325,
						"isHorlift": false,
						"rightDoors": false,
						"name": "Пролетарская",
						"isLast": true
					}
				],
				"signals": [
					[
						"MD3",
						19.0477
					],
					[
						"MDG",
						143.6259
					],
					[
						"MDA100",
						181.5837
					],
					[
						"219",
						196.6065
					],
					[
						"5A",
						280.0352
					],
					[
						"221",
						322.0814
					],
					[
						"219A",
						381.0164
					],
					[
						"223",
						510.5559
					],
					[
						"225",
						654.8644
					],
					[
						"227",
						792.1698
					],
					[
						"229",
						910.1179
					],
					[
						"231",
						1030.8249
					],
					[
						"233",
						1095.8453
					],
					[
						"235",
						1158.3352
					],
					[
						"237",
						1221.0768
					],
					[
						"239A",
						1289.3552
					],
					[
						"239",
						1350.0118
					],
					[
						"27A",
						1399.9782
					],
					[
						"241",
						1521.3638
					],
					[
						"243",
						1731.5634
					],
					[
						"245",
						1931.7584
					],
					[
						"247",
						2151.8986
					],
					[
						"249",
						2356.4315
					],
					[
						"251A",
						2481.4097
					],
					[
						" 251",
						2538.1932
					],
					[
						"PT249A",
						2573.8529
					],
					[
						"PT253",
						2644.5677
					],
					[
						"PT255",
						2707.3049
					],
					[
						"PT257",
						2769.6929
					],
					[
						"PT47A",
						2822.9061
					],
					[
						"PT259",
						2832.16
					],
					[
						"261A",
						2894.7452
					],
					[
						"261B",
						2924.6498
					],
					[
						"PT261M",
						2967.1842
					],
					[
						"PTA201",
						3041.6599
					],
					[
						"263",
						3162.051
					],
					[
						"265",
						3338.8371
					],
					[
						"267",
						3507.0348
					],
					[
						"269M",
						3657.0158
					],
					[
						"273A",
						3735.6493
					],
					[
						"271",
						3810.0102
					],
					[
						"273",
						3885.2571
					],
					[
						"M1",
						3893.1815
					],
					[
						"275",
						3947.9004
					],
					[
						"277",
						4010.2791
					],
					[
						"281A",
						4079.9363
					],
					[
						"279",
						4144.1784
					],
					[
						"283A",
						4197.9247
					],
					[
						"281",
						4286.4398
					],
					[
						"283",
						4417.2586
					],
					[
						"285",
						4562.5001
					],
					[
						"287",
						4685.7643
					],
					[
						"289",
						4800.9504
					],
					[
						"291",
						4919.9424
					],
					[
						"NH293",
						5036.0715
					],
					[
						"NH295",
						5180.9459
					],
					[
						"NH297",
						5306.3799
					],
					[
						"299",
						5373.6023
					],
					[
						"301",
						5435.9521
					],
					[
						"303",
						5498.1445
					],
					[
						"311A",
						5568.3753
					],
					[
						"305",
						5624.3101
					],
					[
						"313A",
						5682.9605
					],
					[
						"307",
						5764.3359
					],
					[
						"315A",
						5839.5876
					],
					[
						"309",
						5926.2981
					],
					[
						"311",
						6126.9837
					],
					[
						"313",
						6346.2035
					],
					[
						"315",
						6556.4057
					],
					[
						"323A",
						6675.4586
					],
					[
						"317",
						6776.5111
					],
					[
						"325A",
						6839.5631
					],
					[
						"OK319",
						6950.3678
					],
					[
						"OK321",
						7039.691
					],
					[
						"OK323",
						7125.2606
					],
					[
						"OK325",
						7187.6476
					],
					[
						"OKA7",
						7240.8247
					],
					[
						"327",
						7249.6336
					],
					[
						"335A",
						7307.9886
					],
					[
						"335B",
						7355.8862
					],
					[
						"329",
						7380.257
					],
					[
						"133A",
						7442.1409
					],
					[
						"331",
						7512.4642
					],
					[
						"333",
						7626.6941
					],
					[
						"335",
						7780.0581
					],
					[
						"337",
						7925.306
					],
					[
						"339",
						8086.6077
					],
					[
						"341",
						8288.965
					],
					[
						"343",
						8434.564
					],
					[
						"353",
						8516.3464
					],
					[
						"345",
						8603.5111
					],
					[
						"347",
						8666.1006
					],
					[
						"349",
						8729.0483
					],
					[
						"351",
						8791.4415
					],
					[
						"RX353",
						8854.2824
					],
					[
						"363A",
						8928.2726
					],
					[
						"363B",
						8961.3163
					],
					[
						"RX355",
						8986.4092
					],
					[
						"RXR3",
						9017.3836
					],
					[
						"RXA3",
						9037.8133
					],
					[
						"357",
						9218.4882
					],
					[
						"359",
						9406.7399
					],
					[
						"361",
						9576.103
					],
					[
						"373A",
						9636.1101
					],
					[
						"363",
						9737.3861
					],
					[
						"365",
						9876.278
					],
					[
						"367",
						10009.2053
					],
					[
						"369",
						10135.6066
					],
					[
						"371",
						10276.541
					],
					[
						"373",
						10417.442
					],
					[
						"375",
						10579.978
					],
					[
						"PR377",
						10708.469
					],
					[
						"PR379",
						10770.3686
					],
					[
						"PR381",
						10832.5667
					],
					[
						"PR383",
						10894.7395
					],
					[
						"PR385",
						10957.2606
					],
					[
						"401A",
						11042.7369
					],
					[
						"401B",
						11068.879
					],
					[
						"PR387",
						11099.3226
					],
					[
						"PRR5",
						11138.9852
					],
					[
						"PRA5",
						11139.8285
					],
					[
						"PRA1ST",
						11246.5446
					]
				],
				"slope": [
					[
						10877.6026,
						5.9302
					],
					[
						10887.5345,
						9.7683
					],
					[
						10897.4206,
						8.365
					],
					[
						10907.255,
						9.7566
					],
					[
						10917.0347,
						8.3506
					],
					[
						10927.2001,
						8.6609
					],
					[
						10937.3064,
						8.753
					],
					[
						10947.3531,
						8.6851
					]
				]
			},
			11284.9326
		],
		[
			{
				"slopes": [
					[
						-10.0,
						360.1912,
						7.0
					],
					[
						0.0,
						440.2883
					],
					[
						-5.0,
						1136.5713,
						0.0
					],
					[
						0.0,
						1345.2872
					],
					[
						-15.0,
						1464.8497
					],
					[
						-20.0,
						1564.4296
					],
					[
						-35.0,
						1634.2338
					],
					[
						0.0,
						1943.696
					],
					[
						-20.0,
						2432.2
					],
					[
						0.0,
						2619.7565
					],
					[
						-5.0,
						2699.3834,
						2.0
					],
					[
						0.0,
						2729.4866
					],
					[
						-45.0,
						2769.3634
					],
					[
						0.0,
						3130.9037
					],
					[
						-45.0,
						3349.6313
					],
					[
						0.0,
						3649.6103
					],
					[
						-35.0,
						4278.0315
					],
					[
						0.0,
						4527.0654
					],
					[
						-5.0,
						4576.539,
						0.0
					],
					[
						0.0,
						4626.3497
					],
					[
						-20.0,
						5366.4481
					],
					[
						0.0,
						5586.0237
					],
					[
						25.0,
						5606.2433
					],
					[
						0.0,
						5805.6187
					],
					[
						-45.0,
						6611.4609
					],
					[
						-15.0,
						6761.4003
					],
					[
						-10.0,
						6967.0225
					],
					[
						0.0,
						7044.9677
					],
					[
						-20.0,
						7591.8818
					],
					[
						0.0,
						8125.7746
					],
					[
						-45.0,
						8822.1769
					],
					[
						0.0,
						9054.8902
					],
					[
						-10.0,
						9397.9305,
						1.0
					],
					[
						0.0,
						9610.4038
					],
					[
						-10.0,
						9880.1576,
						0.0
					],
					[
						0.0,
						9940.6367
					],
					[
						-25.0,
						10098.3218
					],
					[
						0.0,
						10454.6846
					],
					[
						-5.0,
						10843.068,
						0.0
					],
					[
						0.0,
						10892.7203
					]
				],
				"slopeLength": 49.6523,
				"sensors": [
					220.261,
					323.4148,
					2292.818,
					3947.5212,
					4042.6904,
					5841.3845,
					5943.2035,
					7331.8362,
					7430.4004,
					9956.6861,
					10059.1067,
					10886.3145,
					10982.7479
				],
				"stations": [
					{
						"path": 2.0,
						"pos": 339.0018,
						"linkedSensor": 1.0,
						"id": 117.0,
						"isHorlift": false,
						"rightDoors": false,
						"name": "Пролетарская",
						"isLast": false
					},
					{
						"path": 2.0,
						"pos": 2406.5701,
						"linkedSensor": 3.0,
						"id": 116.0,
						"rightDoors": true,
						"name": "Речная",
						"hasSwitches": true
					},
					{
						"dist_last_start": 4183.7819,
						"dist_last_end": 4358.7819,
						"linkedSensor": 4.0,
						"id": 115.0,
						"rightDoors": false,
						"pos": 4058.7819,
						"name_last": "Октябрьской",
						"path": 2.0,
						"name": "Октябрьская",
						"isLast": true
					},
					{
						"path": 2.0,
						"pos": 5958.5305,
						"linkedSensor": 6.0,
						"id": 114.0,
						"hasSwitches": true,
						"rightDoors": false,
						"name": "Нахимовская",
						"isLast": false
					},
					{
						"path": 2.0,
						"pos": 7445.754,
						"linkedSensor": 8.0,
						"id": 113.0,
						"name": "Проспект Суворова",
						"rightDoors": false
					},
					{
						"path": 2.0,
						"pos": 8562.9006,
						"id": 112.0,
						"name": "Политехническая",
						"rightDoors": false
					},
					{
						"path": 2.0,
						"pos": 10074.0949,
						"linkedSensor": 10.0,
						"id": 111.0,
						"name": "Парк Культуры",
						"rightDoors": false
					},
					{
						"dist_last_start": 11123.7078,
						"dist_last_end": 12022.7078,
						"linkedSensor": 12.0,
						"id": 110.0,
						"rightDoors": false,
						"pos": 10998.7078,
						"name_last": "Международной",
						"path": 2.0,
						"name": "Международная",
						"isLast": true
					}
				],
				"signals": [
					[
						"PR376",
						14.4426
					],
					[
						"374",
						208.0673
					],
					[
						"PRR6",
						206.5185
					],
					[
						"PR382A",
						308.5235
					],
					[
						"372",
						344.075
					],
					[
						"380A",
						406.1455
					],
					[
						"370",
						492.6069
					],
					[
						"368",
						644.8573
					],
					[
						"366",
						783.1927
					],
					[
						"364",
						921.7295
					],
					[
						"362",
						1060.337
					],
					[
						"360",
						1211.975
					],
					[
						"358",
						1387.5455
					],
					[
						"356",
						1541.4707
					],
					[
						"386A",
						1632.2293
					],
					[
						"RX354",
						1704.1659
					],
					[
						"RX352",
						1931.2888
					],
					[
						"RX350",
						2007.1185
					],
					[
						"RX348",
						2105.4627
					],
					[
						"RX346",
						2167.4847
					],
					[
						"RX344",
						2229.6113
					],
					[
						"RXR2",
						2259.7071
					],
					[
						"RX154A",
						2280.7199
					],
					[
						"342",
						2291.4208
					],
					[
						"350A",
						2331.1529
					],
					[
						"350B",
						2381.4514
					],
					[
						"340",
						2413.6125
					],
					[
						"348A",
						2476.2105
					],
					[
						"338",
						2563.9045
					],
					[
						"336",
						2703.7632
					],
					[
						"334",
						2843.286
					],
					[
						"332",
						3103.1488
					],
					[
						"330",
						3325.6367
					],
					[
						"OK328",
						3576.0723
					],
					[
						"OK326",
						3693.7198
					],
					[
						"OK324",
						3812.2221
					],
					[
						"OK322",
						3874.5725
					],
					[
						"OK320",
						3944.7043
					],
					[
						"OK130A",
						4007.3383
					],
					[
						"OK130B",
						4040.3636
					],
					[
						"OK318",
						4068.1954
					],
					[
						"128A",
						4131.4666
					],
					[
						"OKREP11",
						4129.5956
					],
					[
						"316",
						4197.0539
					],
					[
						"314",
						4336.9111
					],
					[
						"312",
						4531.6229
					],
					[
						"310",
						4715.4834
					],
					[
						"308",
						4864.9115
					],
					[
						"306",
						5167.3373
					],
					[
						"304",
						5390.2928
					],
					[
						"302",
						5513.7918
					],
					[
						"300",
						5641.891
					],
					[
						"298",
						5735.8568
					],
					[
						"NH296",
						5828.6459
					],
					[
						"302A",
						5909.9921
					],
					[
						"302B",
						5941.5908
					],
					[
						"NH294",
						5967.1915
					],
					[
						"NHR4",
						6028.2965
					],
					[
						"300A",
						6028.3048
					],
					[
						"292",
						6111.2938
					],
					[
						"290",
						6262.8678
					],
					[
						"288",
						6414.3755
					],
					[
						"286",
						6553.1217
					],
					[
						"284",
						6696.7129
					],
					[
						"282",
						6889.3033
					],
					[
						"280",
						7066.7079
					],
					[
						"278",
						7139.55
					],
					[
						"276",
						7201.7011
					],
					[
						"274",
						7264.7513
					],
					[
						"272",
						7326.6129
					],
					[
						"278A",
						7397.5704
					],
					[
						"270M",
						7455.5475
					],
					[
						"66A",
						7507.7257
					],
					[
						"M2",
						7560.2003
					],
					[
						"268",
						7664.5805
					],
					[
						"266",
						7853.2582
					],
					[
						"264",
						8013.255
					],
					[
						"PT262",
						8216.2621
					],
					[
						"PT260",
						8325.3113
					],
					[
						"PT258",
						8387.1687
					],
					[
						"256",
						8450.3447
					],
					[
						"258A",
						8513.2348
					],
					[
						"PT254",
						8574.7375
					],
					[
						"PT252",
						8633.2642
					],
					[
						"PT40A",
						8673.9431
					],
					[
						" 250",
						8800.4097
					],
					[
						"248",
						8955.8941
					],
					[
						"246",
						9209.2012
					],
					[
						"244",
						9437.233
					],
					[
						"242",
						9618.8236
					],
					[
						"242A",
						9675.456
					],
					[
						"240",
						9731.0464
					],
					[
						"238",
						9843.7205
					],
					[
						"236",
						9956.1399
					],
					[
						"238A",
						10019.2279
					],
					[
						"234",
						10083.4067
					],
					[
						"236A",
						10134.3229
					],
					[
						"232",
						10268.4341
					],
					[
						"230",
						10418.6837
					],
					[
						"234A",
						10549.2814
					],
					[
						"MD228",
						10592.3159
					],
					[
						"MD226",
						10686.779
					],
					[
						"MD230A",
						10719.1267
					],
					[
						"MD224",
						10751.4451
					],
					[
						"MD222",
						10816.9266
					],
					[
						"MD220",
						10884.3418
					],
					[
						"MD224A",
						10944.2074
					],
					[
						"MD222A",
						10971.2037
					],
					[
						"MD218",
						11008.4561
					],
					[
						"MDA22",
						11060.8045
					],
					[
						"MDR20",
						11060.6784
					]
				],
				"slope": [
					[
						10843.068,
						-7.4204
					],
					[
						10852.9784,
						-10.0619
					],
					[
						10862.8886,
						-3.2031
					],
					[
						10872.8202,
						-8.7572
					],
					[
						10882.7707,
						-3.9508
					]
				]
			},
			11314.194
		]
	],
	"markers": [
		{
			"PAWrongPath": false,
			"TrackPath": 8.0,
			"PAStationHasSwtiches": true,
			"PADeadlockEnd": false,
			"TrackX": 3045.3635,
			"PAStationRightDoors": false,
			"PALastStation": false,
			"PAStationID": 112.0,
			"PADeadlockStart": false,
			"PAStationHorlift": false,
			"PALineChangeStationID": false,
			"PAStationPath": 1.0,
			"Angles": "{0.0151 0.0116 0}",
			"PAStationName": "Политехническая",
			"Pos": "[2643.106 -15218.3486 -13559]",
			"PAType": 1.0,
			"PALineChange": false,
			"PALineChangeStationPath": false
		},
		{
			"PAWrongPath": false,
			"TrackPath": 8.0,
			"PADeadlockEnd": false,
			"TrackX": 1430.5795,
			"PAStationRightDoors": false,
			"PALastStation": false,
			"PAStationID": 111.0,
			"PADeadlockStart": false,
			"PAStationHorlift": false,
			"PALineChangeStationID": false,
			"PAStationPath": 1.0,
			"PAStationCorrection": -0.2,
			"Angles": "{359.9737 90.0098 0}",
			"PAStationName": "Парк культуры",
			"Pos": "[15720.5762 2171.3127 -14159.9727]",
			"PAType": 1.0,
			"PALineChange": false,
			"PALineChangeStationPath": false
		},
		{
			"PAWrongPath": false,
			"TrackPath": 8.0,
			"PADeadlockEnd": false,
			"TrackX": 4219.6896,
			"PAStationRightDoors": false,
			"PALastStation": false,
			"PAStationID": 113.0,
			"PADeadlockStart": false,
			"PAStationHorlift": false,
			"PALineChangeStationID": false,
			"PAStationPath": 1.0,
			"PAStationCorrection": -0.32,
			"Angles": "{359.9303 189.8595 0}",
			"PAStationName": "Проспект суворова",
			"Pos": "[-8909.3164 13630.9209 -13103.7344]",
			"PAType": 1.0,
			"PALineChange": false,
			"PALineChangeStationPath": false
		},
		{
			"PAWrongPath": false,
			"TrackPath": 8.0,
			"PAStationHasSwtiches": true,
			"PADeadlockEnd": false,
			"TrackX": 5703.4431,
			"PAStationRightDoors": false,
			"PALastStation": false,
			"PAStationID": 114.0,
			"PADeadlockStart": false,
			"PAStationHorlift": false,
			"PALineChangeStationID": false,
			"PAStationPath": 1.0,
			"PAStationCorrection": -0.13,
			"Angles": "{359.9947 180.0953 0}",
			"PAStationName": "Нахимовская",
			"Pos": "[-6462.811 -9388.3916 -12515.5879]",
			"PAType": 1.0,
			"PALineChange": false,
			"PALineChangeStationPath": false
		},
		{
			"PAWrongPath": true,
			"TrackPath": 8.0,
			"PADeadlockEnd": 300.0,
			"TrackX": 7461.6914,
			"PAStationRightDoors": false,
			"PALastStation": true,
			"PAStationID": 115.0,
			"PADeadlockStart": 125.0,
			"PAStationHorlift": false,
			"PAStationPath": 1.0,
			"PAStationCorrection": -1.16,
			"Angles": "{359.9896 224.0125 0}",
			"PAStationName": "Октябрьская",
			"Pos": "[-6919.9121 -12619.8047 -11903.4063]",
			"PAType": 1.0,
			"PALastStationName": "Октябрьской"
		},
		{
			"TrackPath": 8.0,
			"PAStationHasSwtiches": true,
			"PADeadlockEnd": 1024.0,
			"TrackX": 9068.8708,
			"PAStationRightDoors": true,
			"PALastStation": true,
			"PAStationID": 116.0,
			"PADeadlockStart": 70.0,
			"PAStationHorlift": false,
			"PAStationPath": 1.0,
			"PAStationCorrection": -0.53,
			"Angles": "{359.986 269.9643 0}",
			"PAStationName": "Речная",
			"Pos": "[14634.1377 -4787.498 -10740.3975]",
			"PAType": 1.0,
			"PALastStationName": "Речной"
		},
		{
			"PAWrongPath": false,
			"TrackPath": 8.0,
			"PADeadlockEnd": false,
			"TrackX": 400.8237,
			"PAStationRightDoors": false,
			"PALastStation": false,
			"PAStationID": 110.0,
			"PADeadlockStart": false,
			"PAStationHorlift": false,
			"PALineChangeStationID": false,
			"PAStationPath": 1.0,
			"PAStationCorrection": -1.12,
			"Angles": "{359.9808 224.012 0}",
			"PAStationName": "Международная",
			"Pos": "[-7383.6343 -5384.3511 -14474.8086]",
			"PAType": 1.0,
			"PALineChange": false,
			"PALineChangeStationPath": false
		},
		{
			"TrackPath": 9.0,
			"PAStationHasSwtiches": true,
			"TrackX": 2765.8418,
			"PAStationRightDoors": true,
			"PAStationID": 116.0,
			"PAStationPath": 2.0,
			"PAStationCorrection": -0.15,
			"Angles": "{0.0169 89.9291 0}",
			"PAStationName": "Речная",
			"Pos": "[14898.8096 812.436 -10740.1729]",
			"PAType": 1.0
		},
		{
			"TrackPath": 9.0,
			"PADeadlockEnd": 300.0,
			"TrackX": 4417.0536,
			"PAStationRightDoors": false,
			"PALastStation": true,
			"PAStationID": 115.0,
			"PADeadlockStart": 125.0,
			"PAStationPath": 2.0,
			"PAStationCorrection": -1.15,
			"Angles": "{0.02 43.9471 0}",
			"PAStationName": "Октябрьская",
			"Pos": "[-2341.0161 -9602.6484 -11903.5732]",
			"PAType": 1.0,
			"PALastStationName": "Октябрьской"
		},
		{
			"PAWrongPath": false,
			"TrackPath": 9.0,
			"PAStationHasSwtiches": true,
			"PADeadlockEnd": false,
			"TrackX": 6317.7022,
			"PAStationRightDoors": false,
			"PALastStation": false,
			"PAStationID": 114.0,
			"PADeadlockStart": false,
			"PALineChangeStationID": false,
			"PAStationPath": 2.0,
			"PAStationCorrection": -0.25,
			"Angles": "{0.0378 359.9499 0}",
			"PAStationName": "Нахимовская",
			"Pos": "[-754.0745 -10085.2832 -12514.2578]",
			"PAType": 1.0,
			"PALineChange": false,
			"PALineChangeStationPath": false
		},
		{
			"TrackPath": 9.0,
			"TrackX": 7804.8957,
			"PAStationRightDoors": false,
			"PAStationID": 113.0,
			"PAStationPath": 2.0,
			"PAStationCorrection": -0.28,
			"Angles": "{359.9978 10.0093 0}",
			"PAStationName": "Проспект Суворова",
			"Pos": "[-3029.7468 13519.7461 -13103.3389]",
			"PAType": 1.0
		},
		{
			"TrackPath": 9.0,
			"TrackX": 8922.3223,
			"PAStationRightDoors": false,
			"PAStationID": 112.0,
			"PAStationPath": 2.0,
			"Angles": "{359.9877 180.0597 0}",
			"PAStationName": "Политехническая",
			"Pos": "[-2813.5425 -14490.4697 -13560.2158]",
			"PAType": 1.0
		},
		{
			"TrackPath": 9.0,
			"TrackX": 10433.5166,
			"PAStationRightDoors": false,
			"PAStationID": 111.0,
			"PAStationPath": 2.0,
			"Angles": "{359.9938 270.1042 0}",
			"PAStationName": "Парк Культуры",
			"Pos": "[14970.3359 -3725.5752 -14161.0762]",
			"PAType": 1.0
		},
		{
			"TrackPath": 9.0,
			"PADeadlockEnd": 1024.0,
			"TrackX": 11357.0795,
			"PAStationRightDoors": false,
			"PALastStation": true,
			"PAStationID": 110.0,
			"PADeadlockStart": 125.0,
			"PAStationPath": 2.0,
			"PAStationCorrection": -1.05,
			"Angles": "{0.0058 44.0593 0}",
			"PAStationName": "Международная",
			"Pos": "[-2804.7344 -2366.4001 -14474.418]",
			"PAType": 1.0,
			"PALastStationName": "Международной"
		},
		{
			"PAWrongPath": false,
			"TrackPath": 8.0,
			"PADeadlockEnd": 450.0,
			"TrackX": 11183.813,
			"PAStationRightDoors": false,
			"PALastStation": true,
			"PAStationID": 117.0,
			"PADeadlockStart": 200.0,
			"PAStationHorlift": false,
			"PALineChangeStationID": false,
			"PAStationPath": 1.0,
			"Angles": "{0.0348 270.1003 0}",
			"PAStationName": "Пролетарская",
			"Pos": "[-15550.7725 -5428.5127 -9836.5]",
			"PAType": 1.0,
			"PALineChange": false,
			"PALineChangeStationPath": false,
			"PALastStationName": "Пролетарской"
		},
		{
			"PAWrongPath": false,
			"TrackPath": 9.0,
			"PADeadlockEnd": false,
			"TrackX": 697.923,
			"PAStationRightDoors": false,
			"PALastStation": false,
			"PAStationID": 117.0,
			"PADeadlockStart": false,
			"PAStationHorlift": false,
			"PALineChangeStationID": false,
			"PAStationPath": 2.0,
			"Angles": "{0.034 89.8576 0}",
			"PAStationName": "Пролетарская",
			"Pos": "[-14853.0762 636.587 -9835.2793]",
			"PAType": 1.0,
			"PALineChange": false,
			"PALineChangeStationPath": false
		}
	],
	"117": {
		"116": [
			{
				"slopes": [
					[
						-10.0,
						289.6078,
						7.0
					],
					[
						0.0,
						369.7049
					],
					[
						-5.0,
						1065.9879,
						0.0
					],
					[
						0.0,
						1274.7038
					],
					[
						-15.0,
						1394.2663
					],
					[
						-20.0,
						1493.8462
					],
					[
						-35.0,
						1563.6504
					],
					[
						0.0,
						1873.1126
					],
					[
						-20.0,
						2361.6166
					],
					[
						0.0,
						2549.1731
					],
					[
						-5.0,
						2628.8,
						2.0
					],
					[
						0.0,
						2658.9031
					],
					[
						-45.0,
						2698.78
					],
					[
						0.0,
						3060.3203
					],
					[
						-45.0,
						3279.0479
					],
					[
						0.0,
						3579.0269
					],
					[
						-35.0,
						4207.4481
					],
					[
						0.0,
						4456.482
					],
					[
						-5.0,
						4505.9556,
						0.0
					],
					[
						0.0,
						4555.7663
					],
					[
						-20.0,
						5295.8646
					],
					[
						0.0,
						5515.4403
					],
					[
						25.0,
						5535.6599
					],
					[
						0.0,
						5735.0352
					],
					[
						-45.0,
						6540.8774
					],
					[
						-15.0,
						6690.8169
					],
					[
						-10.0,
						6896.4391
					],
					[
						0.0,
						6974.3843
					],
					[
						-20.0,
						7521.2984
					],
					[
						0.0,
						8055.1912
					],
					[
						-45.0,
						8751.5935
					],
					[
						0.0,
						8984.3068
					],
					[
						-10.0,
						9327.3471,
						1.0
					],
					[
						0.0,
						9539.8204
					],
					[
						-10.0,
						9809.5742,
						0.0
					],
					[
						0.0,
						9870.0532
					],
					[
						-25.0,
						10027.7384
					],
					[
						0.0,
						10384.1012
					],
					[
						-5.0,
						10772.4846,
						0.0
					],
					[
						0.0,
						10822.1369
					]
				],
				"signals": [
					[
						"374",
						137.4839
					],
					[
						"PRR6",
						135.9351
					],
					[
						"PR382A",
						237.9401
					],
					[
						"372",
						273.4915
					],
					[
						"380A",
						335.5621
					],
					[
						"370",
						422.0235
					],
					[
						"368",
						574.2738
					],
					[
						"366",
						712.6093
					],
					[
						"364",
						851.1461
					],
					[
						"362",
						989.7535
					],
					[
						"360",
						1141.3916
					],
					[
						"358",
						1316.9621
					],
					[
						"356",
						1470.8872
					],
					[
						"386A",
						1561.6459
					],
					[
						"RX354",
						1633.5825
					],
					[
						"RX352",
						1860.7054
					],
					[
						"RX350",
						1936.5351
					],
					[
						"RX348",
						2034.8792
					],
					[
						"RX346",
						2096.9013
					],
					[
						"RX344",
						2159.0278
					],
					[
						"RXR2",
						2189.1237
					],
					[
						"RX154A",
						2210.1364
					],
					[
						"342",
						2220.8374
					],
					[
						"350A",
						2260.5695
					],
					[
						"350B",
						2310.868
					],
					[
						"340",
						2343.0291
					],
					[
						"348A",
						2405.6271
					],
					[
						"338",
						2493.3211
					],
					[
						"336",
						2633.1798
					],
					[
						"334",
						2772.7026
					],
					[
						"332",
						3032.5654
					],
					[
						"330",
						3255.0533
					],
					[
						"OK328",
						3505.4889
					],
					[
						"OK326",
						3623.1364
					],
					[
						"OK324",
						3741.6387
					],
					[
						"OK322",
						3803.9891
					],
					[
						"OK320",
						3874.1209
					],
					[
						"OK130A",
						3936.7549
					],
					[
						"OK130B",
						3969.7802
					],
					[
						"OK318",
						3997.612
					],
					[
						"128A",
						4060.8832
					],
					[
						"OKREP11",
						4059.0122
					],
					[
						"316",
						4126.4705
					],
					[
						"314",
						4266.3276
					],
					[
						"312",
						4461.0395
					],
					[
						"310",
						4644.9
					],
					[
						"308",
						4794.3281
					],
					[
						"306",
						5096.7539
					],
					[
						"304",
						5319.7094
					],
					[
						"302",
						5443.2084
					],
					[
						"300",
						5571.3076
					],
					[
						"298",
						5665.2734
					],
					[
						"NH296",
						5758.0625
					],
					[
						"302A",
						5839.4087
					],
					[
						"302B",
						5871.0074
					],
					[
						"NH294",
						5896.6081
					],
					[
						"NHR4",
						5957.713
					],
					[
						"300A",
						5957.7214
					],
					[
						"292",
						6040.7104
					],
					[
						"290",
						6192.2844
					],
					[
						"288",
						6343.7921
					],
					[
						"286",
						6482.5382
					],
					[
						"284",
						6626.1295
					],
					[
						"282",
						6818.7199
					],
					[
						"280",
						6996.1245
					],
					[
						"278",
						7068.9666
					],
					[
						"276",
						7131.1177
					],
					[
						"274",
						7194.1679
					],
					[
						"272",
						7256.0294
					],
					[
						"278A",
						7326.987
					],
					[
						"270M",
						7384.9641
					],
					[
						"66A",
						7437.1423
					],
					[
						"M2",
						7489.6169
					],
					[
						"268",
						7593.9971
					],
					[
						"266",
						7782.6748
					],
					[
						"264",
						7942.6716
					],
					[
						"PT262",
						8145.6787
					],
					[
						"PT260",
						8254.7279
					],
					[
						"PT258",
						8316.5853
					],
					[
						"256",
						8379.7613
					],
					[
						"258A",
						8442.6514
					],
					[
						"PT254",
						8504.1541
					],
					[
						"PT252",
						8562.6808
					],
					[
						"PT40A",
						8603.3597
					],
					[
						" 250",
						8729.8263
					],
					[
						"248",
						8885.3106
					],
					[
						"246",
						9138.6178
					],
					[
						"244",
						9366.6496
					],
					[
						"242",
						9548.2401
					],
					[
						"242A",
						9604.8726
					],
					[
						"240",
						9660.463
					],
					[
						"238",
						9773.1371
					],
					[
						"236",
						9885.5565
					],
					[
						"238A",
						9948.6445
					],
					[
						"234",
						10012.8233
					],
					[
						"236A",
						10063.7395
					],
					[
						"232",
						10197.8507
					],
					[
						"230",
						10348.1003
					],
					[
						"234A",
						10478.698
					],
					[
						"MD228",
						10521.7325
					],
					[
						"MD226",
						10616.1956
					],
					[
						"MD230A",
						10648.5432
					],
					[
						"MD224",
						10680.8617
					],
					[
						"MD222",
						10746.3432
					],
					[
						"MD220",
						10813.7584
					],
					[
						"MD224A",
						10873.624
					],
					[
						"MD222A",
						10900.6203
					],
					[
						"MD218",
						10937.8726
					],
					[
						"MDA22",
						10990.2211
					],
					[
						"MDR20",
						10990.095
					]
				],
				"sensors": [
					149.6776,
					252.8314,
					2222.2346,
					3876.9378,
					3972.107,
					5770.8011,
					5872.62,
					7261.2528,
					7359.817,
					8373.4463,
					9886.1027,
					9988.5233,
					10815.7311,
					10912.1645
				],
				"slope": [
					[
						10772.4846,
						-7.4204
					],
					[
						10782.395,
						-10.0619
					],
					[
						10792.3052,
						-3.2031
					],
					[
						10802.2368,
						-8.7572
					],
					[
						10812.1873,
						-3.9508
					]
				],
				"slopeLength": 49.6523,
				"stations": []
			},
			11243.6106
		]
	}
}